//2015.09

Задача 5 (10 точки) . Текстов файл с име comproc1 съдържа зададената подолу
последователност от команди на bash за Linux. Напишете вдясно какво ще бъде изведено на
стандартния изход след стартиране на файла с команден ред
bash comproc1 12 34 56  //$# = 3
ако на стандартния вход бъде подадена последователността от символи 5 6
var=1							
for i in 4 3 2 1     // само за 4 имаме резултат
do for j
	do if test $i –gt $#       
			then var=` expr $var \* $i`   // Iter1: var = 4; Iter2: var = 16; Iter3: var = 64 
			echo $var $j >> ff            // ******************** 
		else continue
		fi
	done
done
while true
do echo $*  // --> output: 12 34 56
	break
done
read k1 k2 // 5 6
while cat ff | grep $k2 //намираме редовете във ff съдържащи 6
do set $k1 $var         // 5 и 64 са новите поз параметри
	shift				// остава само 64
	echo $2				// --> \n
	grep $i ff			// i НЕ Е ИЗВЪН scope-a!!!!!! Достигаме стойността му, която е 1 и 
						// принтираме съответните редове
	exit				//излизаме
	echo $1
done
wc –l < ff
echo END



 output: 
 12 34 56
 16 34
64 56
\n
4 12
16 34

ff:
4 12
16 34
64 56